paper/validation/codex_openfoam_validation/bead3p0/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// T-junction with a one-sided 3.0 mm bead intrusion from the right wall.

scale   1;

vertices
(
    (0.0   -0.21 0)   // 0
    (0.2   -0.21 0)   // 1
    (0.217 -0.21 0)   // 2
    (0.22  -0.21 0)   // 3

    (0.0   -0.01 0)   // 4
    (0.2   -0.01 0)   // 5
    (0.217 -0.01 0)   // 6
    (0.22  -0.01 0)   // 7

    (0.0    0.01 0)   // 8
    (0.2    0.01 0)   // 9
    (0.217  0.01 0)   // 10
    (0.22   0.01 0)   // 11

    (0.0    0.21 0)   // 12
    (0.2    0.21 0)   // 13
    (0.217  0.21 0)   // 14
    (0.22   0.21 0)   // 15

    (0.0   -0.21 0.02)   // 16
    (0.2   -0.21 0.02)   // 17
    (0.217 -0.21 0.02)   // 18
    (0.22  -0.21 0.02)   // 19

    (0.0   -0.01 0.02)   // 20
    (0.2   -0.01 0.02)   // 21
    (0.217 -0.01 0.02)   // 22
    (0.22  -0.01 0.02)   // 23

    (0.0    0.01 0.02)   // 24
    (0.2    0.01 0.02)   // 25
    (0.217  0.01 0.02)   // 26
    (0.22   0.01 0.02)   // 27

    (0.0    0.21 0.02)   // 28
    (0.2    0.21 0.02)   // 29
    (0.217  0.21 0.02)   // 30
    (0.22   0.21 0.02)   // 31
);

blocks
(
    hex (4 5 9 8 20 21 25 24) (50 5 5) simpleGrading (1 1 1)
    hex (5 6 10 9 21 22 26 25) (4 5 5) simpleGrading (1 1 1)

    hex (1 2 6 5 17 18 22 21) (4 50 5) simpleGrading (1 1 1)
    hex (2 3 7 6 18 19 23 22) (1 50 5) simpleGrading (1 1 1)

    hex (9 10 14 13 25 26 30 29) (4 50 5) simpleGrading (1 1 1)
    hex (10 11 15 14 26 27 31 30) (1 50 5) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (4 20 24 8)
        );
    }

    outlet1
    {
        type patch;
        faces
        (
            (1 2 18 17)
            (2 3 19 18)
        );
    }

    outlet2
    {
        type patch;
        faces
        (
            (13 29 30 14)
            (14 30 31 15)
        );
    }

    defaultFaces
    {
        type wall;
        faces ();
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
